mathiscastel29560-arch/Esp32/src/menu.cpp
std::vector<String> hardwareTestMenuItems() {
    return {
        "🔘 GPIO (buttons, buzzer, battery)",
        "⏰ RTC (DS3231 clock)",
        "🛰️  GPS (NEO-6M)",
        "📱 PN532 (NFC/RFID)",
        "📶 CC1101 (433MHz)",
        "📶 NRF24 (2.4GHz)",
        "🔙 Back",
    };
}

std::vector<String> deviceInfoMenuItems() {
    return {
        "📋 View Full Config",
        "🔌 Pin Assignments",
        "⚠️  Hardware Guards Status",
        "📊 Initialized Modules",
        "🔙 Back",
    };
}

std::vector<String> debugInfoMenuItems() {
    return {
        "💾 Memory & PSRAM",
        "🔋 Battery Status",
        "📱 Active Modules",
        "⚠️  Last Errors",
        "🔙 Back",
    };
}

std::vector<String> calibrationMenuItems() {
    return {
        "🔋 Battery ADC Calibration",
        "📡 RF Signal Level",
        "🎨 Display Calibration",
        "🔙 Back",
    };
}

std::vector<String> aboutMenuItems() {
    return {
        "📋 Firmware Version",
        "🏷️  Device Serial",
        "📍 MAC Address",
        "💾 Flash Size",
        "⏱️  Uptime",
        "🔙 Back",
    };
}

std::vector<String> networkMenuItems() {
    return {
        "📡 WiFi Status",
        "🔌 IP Address",
        "🌐 Hostname",
        "🔐 WiFi Settings",
        "🔙 Back",
    };
}

std::vector<String> systemMenuItems() {
    return {
        "⚙️  TX Arm Status",
        "🔋 Battery Status",
        "🗺️  GPS Map",
        "🔄 Dualboot OTA1",
        "🔙 Back",
    };
}

std::vector<String> iotMenuItems() {
    return {
        "🌐 Zigbee Scanner",
        "🌐 MQTT Hijacker",
        "🌐 Z-Wave Scanner",
        "🌐 Bluetooth Classic",
        "🌐 CoAP Scanner",
        "🌐 LoRaWAN Recon",
        "🌐 RFID Emulator",
        "🌐 Mifare Classic",
        "🌐 NFC Cloner",
        "🌐 Smart Home Hijacker",
        "🌐 Spectrum Analyzer+",
        "🌐 Modulation Classifier",
        "🌐 Auto Handshake Capture",
        "🌐 Generic Packet Tools",
        "🌐 Advanced WiFi Attacks",
        "🔙 Back",
    };
}

std::vector<String> helpMenuItems() {
    std::vector<String> items;
    String lastCat = "";

    for (size_t i = 0; i < HelpContent::TOPIC_COUNT; i++) {
        String cat = HelpContent::TOPICS[i].category;
        if (cat != lastCat) {
            items.push_back(String("[") + cat.substring(0, 1) + "] " + cat);
            lastCat = cat;
        }
    }
    items.push_back("Back");
    return items;
}

void showResult(const String &title, const String &body) {
    g_resultTitle = title;
    g_resultBody = body;
    g_resultShowTime = millis();
    g_state = RESULT_SCREEN;
}

void runWifiAction(int idx) {
    switch (idx) {
        case 0: { // Scan
            auto results = WifiTools::scan();
            if (results.empty()) {
                showResult("WiFi Scan", "No networks found");
            } else {
                // Build visualization data from scan results
                ScanVisualizations::WifiScanData vizData;
                vizData.channelCounts.resize(14, 0);
                vizData.totalNetworks = results.size();
                vizData.strongestRssi = results[0].rssi;
                vizData.strongestSsid = results[0].ssid;

                // Populate channel distribution
                for (const auto &ap : results) {
                    if (ap.channel > 0 && ap.channel <= 14) {
                        vizData.channelCounts[ap.channel - 1]++;
                    }
                }

                // Show enhanced visualization
                ScanVisualizations::showWifiVisualization(vizData);
            }
            break;
        }
        case 1: { // Reveal hidden networks
            auto result = WiFiHiddenRevealer::revealHiddenNetworks(10000);
            if (result.networksFound > 0) {
                showResult("Hidden Networks",
                          "Found: " + String(result.networksFound) + "\n" +
                          "Check logs for details");
            } else {
                showResult("Hidden Networks", "No hidden networks found");
            }
            break;
        }
        case 2: { // IoT Device Hunter
            auto result = IoTDeviceHunter::huntDevices(15000);
            if (result.devicesFound > 0) {
                // Show device distribution visualization
                AdvancedScanning::NetworkDeviceData iotData;
                iotData.title = "IoT Devices";
                iotData.totalDevices = result.devicesFound;
                iotData.strongestSignal = -50;  // Simulated
                iotData.strongestDeviceName = "SmartDevice-1";

                // Create device type distribution
                iotData.devicesByType = {(uint16_t)(result.devicesFound / 2),
                                        (uint16_t)(result.devicesFound / 4),
                                        (uint16_t)(result.devicesFound / 4)};
                iotData.typeLabels = {"WiFi", "BLE", "Zigbee"};

                AdvancedScanning::showNetworkDevices(iotData);
            } else {
                showResult("IoT Devices", "No IoT devices found");
            }
            break;
        }
        case 3: { // Smart Lock Scanner
            auto result = SmartLockScanner::scanSmartLocks(15000);
            if (result.locksFound > 0) {
                // Show lock distribution visualization
                AdvancedScanning::NetworkDeviceData lockData;
                lockData.title = "Smart Locks";
                lockData.totalDevices = result.locksFound;
                lockData.strongestSignal = -55;  // Simulated
                lockData.strongestDeviceName = "Lock-Frontend";

                // Create lock type distribution
                lockData.devicesByType = {(uint16_t)(result.locksFound * 0.6),
                                         (uint16_t)(result.locksFound * 0.4)};
                lockData.typeLabels = {"BLE", "WiFi"};

                AdvancedScanning::showNetworkDevices(lockData);
            } else {
                showResult("Smart Lock Scanner", "No smart locks found");
            }
            break;
        }
        case 4: { // Frequency Analyzer
            auto result = FrequencyAnalyzer::analyzeBands(20000);
            showResult("Frequency Analysis",
                      "Signals: " + String(result.totalSignals) + "\n" +
                      "Bands analyzed: 2.4GHz + 433MHz");
            break;
        }
        case 5: { // Beacon spam toggle
            if (BeaconSpam::active()) {
                BeaconSpam::stop();
                showResult("Beacon Spam", "STOPPED");
            } else {
                std::vector<String> ssids = {"TEST-AP-1", "TEST-AP-2", "Free-WiFi"};
                if (BeaconSpam::start(ssids)) {
                    showResult("Beacon Spam", "STARTED\n(Hold BACK to arm)");
                } else {
                    showResult("Beacon Spam", "Failed to start");
                }
            }
            break;
        }
        case 6: { // Evil Portal toggle
            if (EvilPortal::active()) {
                EvilPortal::stop();
                showResult("Evil Portal", "STOPPED");
            } else {
                if (EvilPortal::start("Free-WiFi", 600000)) {
                    showResult("Evil Portal", "STARTED\nCheck logs/");
                } else {
                    showResult("Evil Portal", "Failed to start");
                }
            }
            break;
        }
        case 7: { // WiFi Deauth
            if (WiFiDeauth::isActive()) {
                WiFiDeauth::stop();
                showResult("WiFi Deauth", "STOPPED");
            } else {
                auto result = WiFiDeauth::sendDeauthFrames("FF:FF:FF:FF:FF:FF", 15000, true);
                showResult("WiFi Deauth",
                          "Sent: " + String(result.deauthCount) + " frames\n" +
                          "Rate: " + String((result.deauthCount * 1000) / 15000) + "/sec");
            }
            break;
        }
        case 8: { // WiFi Jammer Suite
            if (WiFiJammerSuite::isActive()) {
                WiFiJammerSuite::stop();
                showResult("WiFi Jammer", "STOPPED");
            } else {
                auto result = WiFiJammerSuite::jamWiFiNetwork(6, 10000, "ALL");
                showResult("WiFi Jammer Suite",
                          "Sent: " + String(result.jamPacketsCount) + " packets\n" +
                          "Rate: " + String((result.jamPacketsCount * 1000) / 10000) + "/sec");
            }
            break;
        }
        case 9: { // Association Hijacker
            auto result = WiFiAssociationHijacker::hijackAssociation("AA:BB:CC:DD:EE:FF", 10000);
            showResult("WiFi Association Hijack",
                      "Spoofed: " + result.spoofedMAC + "\n" +
                      "Attempts: " + String(result.associationsCount));
            break;
        }
        case 10: { // HTTP Downgrade Attack
            auto result = HTTPDowngradeAttack::executeDowngrade(20000);
            showResult("HTTP Downgrade (SSL Strip)",
                      "Redirects: " + String(result.redirectsCount) + "\n" +
                      "Creds captured: " + String(result.credentialsIntercepted));
            break;
        }
        case 11: { // WPA2 Handshake Cracker
            auto result = WPA2HandshakeCracker::captureAndCrack("TestNetwork", 30000);
            showResult("WPA2 Cracker",
                      "Password: " + (result.passwordFound ? result.password : "NOT FOUND") + "\n" +
                      "Attempts: " + String(result.attemptsCount));
            break;
        }
        case 12: { // Capture Handshake (WPA2)
            // Use HTTP API to capture handshake with specific target
            // Default example: common AP BSSID + channel
            String targetBssid = "AA:BB:CC:DD:EE:FF";  // Replace with real AP
            uint8_t channel = 6;  // Replace with real channel from scan
            auto result = HandshakeCapture::capture(targetBssid, channel, 30000);
            if (result.filePath.length() > 0) {
                showResult("Handshake Captured",
                          "File: " + result.filePath + "\n" +
                          "EAPOL frames: " + String(result.eapolFrames) + "\n" +
                          "Use web API for targeting");
            } else {
                showResult("Handshake Capture",
                          String("No EAPOL frames captured.\n") +
                          "Use /api/wifi/handshake API");
            }
            break;
        }
    }
}

void runBleAction(int idx) {
    switch (idx) {
        case 0: { // Scan
            auto results = BleTools::scan(5);
            if (results.empty()) {
                showResult("BLE Scan", "No devices found");
            } else {
                // Build visualization data from scan results
                ScanVisualizations::BleScanData vizData;
                vizData.totalDevices = results.size();
                vizData.strongestRssi = results[0].rssi;
                vizData.strongestDevice = results[0].name.isEmpty() ? results[0].address : results[0].name;
                vizData.scanning = false;

                // Collect all RSSI values for histogram
                for (const auto &device : results) {
                    vizData.rssiValues.push_back(device.rssi);
                }

