mathiscastel29560-arch/Esp32/src/menu.cpp
                // Show enhanced visualization
                ScanVisualizations::showBleVisualization(vizData);
            }
            break;
        }
        case 1: { // BLE Address Spoof
            auto result = BLESpoof::spoofBLEAddress("SmartDevice", "AA:BB:CC:DD:EE:FF");
            showResult("BLE Address Spoof",
                      "Spoofed: " + result.spoofedMAC + "\n" +
                      "Advertising as: " + result.targetDevice);
            break;
        }
        case 2: { // BLE Pairing Attack
            auto result = BLEPairingAttack::attackPairing("Target", 10000);
            showResult("BLE Pairing Attack",
                      "Attempts: " + String(result.attemptsCount) + "\n" +
                      "Method: " + result.method);
            break;
        }
        case 3: { // BLE DoS Attack
            auto result = BLE_DOS::launchDOS("AllDevices", 10000);
            showResult("BLE DoS Attack",
                      "Packets sent: " + String(result.packetsCount) + "\n" +
                      "Method: " + result.method);
            break;
        }
        case 4: { // BLE Beacon Spam
            if (BLEBeaconSpam::isActive()) {
                BLEBeaconSpam::stop();
                showResult("BLE Beacon Spam", "STOPPED");
            } else {
                auto result = BLEBeaconSpam::spamBeacons("ALL", 15000);
                showResult("BLE Beacon Spam",
                          "Sent: " + String(result.beaconsCount) + " beacons\n" +
                          "Rate: ~" + String((result.beaconsCount * 1000) / result.durationMs) + "/sec");
            }
            break;
        }
        case 5: { // BLE Advertising Jammer
            if (BLEAdvertisingJammer::isActive()) {
                BLEAdvertisingJammer::stop();
                showResult("BLE Advertising Jam", "STOPPED");
            } else {
                auto result = BLEAdvertisingJammer::jamAdvertising(15000, "NOISE");
                showResult("BLE Advertising Jam",
                          "Sent: " + String(result.jamPacketsCount) + " jam packets\n" +
                          "Rate: ~" + String((result.jamPacketsCount * 1000) / 15000) + "/sec");
            }
            break;
        }
        case 6: { // Bluetooth Aggressive Jammer
            if (BluetoothAggressiveJammer::isActive()) {
                BluetoothAggressiveJammer::stop();
                showResult("Bluetooth Aggressive Jam", "STOPPED");
            } else {
                auto result = BluetoothAggressiveJammer::jamBluetooth(15000);
                showResult("Bluetooth Aggressive Jam",
                          "Sent: " + String(result.jamPacketsCount) + " packets\n" +
                          "Duration: " + String(result.durationMs) + "ms");
            }
            break;
        }
        case 7: { // BLE Advanced Attack Suite
            if (BLEAdvancedAttackSuite::isActive()) {
                BLEAdvancedAttackSuite::stop();
                showResult("BLE Advanced Attacks", "STOPPED");
            } else {
                auto result = BLEAdvancedAttackSuite::attackBLE(15000, "ALL");
                showResult("BLE Advanced Attacks",
                          "Packets: " + String(result.attackPacketsCount) + "\n" +
                          "Method: GATT + Eavesdrop");
            }
            break;
        }
        case 8: { // Spam watch toggle
            if (BleSpamDetector::active()) {
                BleSpamDetector::stop();
                showResult("BLE Spam Watch", "STOPPED");
            } else {
                BleSpamDetector::start();
                showResult("BLE Spam Watch", "STARTED\n(passive, no TX)");
            }
            break;
        }
        case 9: { // Check alert
            auto alert = BleSpamDetector::checkAlert();
            if (alert.type.length() > 0) {
                showResult("BLE Spam Alert", alert.type + "\n" +
                          "MACs: " + String(alert.distinctMacs) + "\n" +
                          "RSSI: " + String(alert.strongestRssi) + "dBm");
            } else {
                showResult("BLE Spam Alert", "No alerts detected");
            }
            break;
        }
    }
}

void runRfAction(int idx) {
    switch (idx) {
        case 0: { // 2.4GHz spectrum
            auto activity = Nrf24Tools::scanChannels(20);
            uint8_t best = 0;
            for (size_t i = 1; i < activity.size(); i++) {
                if (activity[i] > activity[best]) best = i;
            }
            showResult("2.4GHz Spectrum",
                      "Busiest: CH" + String(best) + "\n" +
                      "Activity: " + String(activity[best]));
            break;
        }
        case 1: { // Drone Tracker
            auto result = DroneTracker::scanForDrones(5000);
            if (result.activeDroneCount > 0) {
                showResult("Drone Tracker",
                          "Channels: " + String(result.activeDroneCount) + "\n" +
                          "Avg dist: " + String(result.averageDistance, 1) + "m");
            } else {
                showResult("Drone Tracker", "No signals detected");
            }
            break;
        }
        case 2: { // Signal Sniffer
            auto result = SignalSniffer::sniffTraffic(0xFF, 3000);
            if (result.packetsCapture > 0) {
                bool hopDetected = SignalSniffer::detectFrequencyHopping(result);
                String protocol = SignalSniffer::identifyProtocol(result);
                showResult("Signal Sniffer",
                          "Packets: " + String(result.packetsCapture) + "\n" +
                          "Hopping: " + String(hopDetected ? "YES" : "NO") + "\n" +
                          "Protocol: " + protocol);
            } else {
                showResult("Signal Sniffer", "No packets captured");
            }
            break;
        }
        case 3: { // NRF24 Replay Attack
            auto pkt = Nrf24Replay::capturePacket(1, 3000);
            if (pkt.data.size() > 0) {
                auto result = Nrf24Replay::replayPacket(pkt, 5);
                showResult("NRF24 Replay",
                          "Captured: " + String(pkt.data.size()) + " bytes\n" +
                          "Replayed: " + String(result.packetsSent) + " times");
            } else {
                showResult("NRF24 Replay", "No packets captured");
            }
            break;
        }
        case 4: { // Sub-GHz Scanner
            auto result = SubghzScanner::scanBand(8000);
            if (result.detectionCount > 0) {
                showResult("Sub-GHz Scanner",
                          "Signals: " + String(result.detectionCount) + "\n" +
                          "Strongest: " + String(result.strongestSignal) + "dBm @ " +
                          String(result.busyFrequency, 2) + "MHz");
            } else {
                showResult("Sub-GHz Scanner", "No signals detected");
            }
            break;
        }
        case 5: { // Sub-GHz bruteforce
            auto result = SubghzBruteforce::bruteForce("GENERIC", 15000);
            showResult("Sub-GHz Bruteforce",
                      "Sent " + String(result.attemptsCount) + " codes\n" +
                      "Freq: " + result.frequency + " OOK\n" +
                      "Check device response!");
            break;
        }
        case 6: { // Sub-GHz Replay
            showResult("Sub-GHz Replay",
                      "Record mode not yet\nconfigured in menu\n(see source code)");
            break;
        }
        case 7: { // IR TV toggle
            showResult("IR: TV Power", "Sending codes...\n(requires IR LED)");
            break;
        }
        case 8: { // IR Bruteforce TV
            IRBruteforce::BruteResult result = IRBruteforce::bruteForce("TV", 10000);
            showResult("IR: TV Bruteforce",
                      "Sent " + String(result.attemptsCount) + " codes\n" +
                      "Check if TV responded!");
            break;
        }
        case 9: { // IR Bruteforce AC
            IRBruteforce::BruteResult result = IRBruteforce::bruteForce("AC", 10000);
            showResult("IR: AC Bruteforce",
                      "Sent " + String(result.attemptsCount) + " codes\n" +
                      "Check if AC responded!");
            break;
        }
        case 10: { // IR Bruteforce Light
            IRBruteforce::BruteResult result = IRBruteforce::bruteForce("LIGHT", 10000);
            showResult("IR: Light Bruteforce",
                      "Sent " + String(result.attemptsCount) + " codes\n" +
                      "Check if light responded!");
            break;
        }
        case 11: { // GPS Spoofing
            auto result = GPSSpoof::spoofGPS(48.8566f, 2.3522f, 20000, "SIGNAL");
            showResult("GPS Spoofing",
                      "Packets: " + String(result.packetsCount) + "\n" +
                      "Location: " + String(result.spoofedLat, 4) + ", " + String(result.spoofedLon, 4));
            break;
        }
        case 12: { // Advanced RF Jammer
            if (AdvancedRFJammer::isActive()) {
                AdvancedRFJammer::stop();
                showResult("Advanced RF Jammer", "STOPPED");
            } else {
                auto result = AdvancedRFJammer::jamRFSignals("433MHz", 10000, "NOISE");
                showResult("Advanced RF Jammer",
                          "Packets: " + String(result.jamPacketsCount) + "\n" +
                          "Method: " + result.method);
            }
            break;
        }
        case 13: { // Sub-GHz Jammer Suite
            if (SubghzJammerSuite::isActive()) {
                SubghzJammerSuite::stop();
                showResult("Sub-GHz Jammer", "STOPPED");
            } else {
                auto result = SubghzJammerSuite::jamSubghzDevices(10000);
                showResult("Sub-GHz Jammer Suite",
                          "Codes sent: " + String(result.jamPacketsCount) + "\n" +
                          "Target: 433 MHz");
            }
            break;
        }
        case 14: { // Jamming Signal Generator
            if (JammingSignalGenerator::isActive()) {
                JammingSignalGenerator::stop();
                showResult("Jamming Signal Gen", "STOPPED");
            } else {
                auto result = JammingSignalGenerator::generateJammingSignal(10000, "WHITE");
                showResult("Jamming Signal Generator",
                          "Signals: " + String(result.signalsGenerated) + "\n" +
                          "Type: " + result.noiseType);
            }
            break;
        }
        case 15: { // RF Signal Recorder
            auto result = RfSignalRecorder::recordSignals(433.0, 5000, "cc1101");
            if (result.success) {
                auto stats = RfSignalRecorder::analyzeSignal();
                showResult("RF Signal Recorder",
                          "Samples: " + String(result.sampleCount) + "\n" +
                          "RSSI: " + String(result.rssiAvg, 1) + " dBm\n" +
                          "Transitions: " + String(stats.transitionCount));
            } else {
                showResult("RF Signal Recorder", "Capture failed");
            }
            break;
        }
        case 16: { // Signal Decoder
            auto decoded = SignalDecoder::decodeSignal();
            if (decoded.success) {
                showResult("Signal Decoder",
                          "Format: " + decoded.format + "\n" +
                          "Modulation: " + decoded.modulationType + "\n" +
                          "Bitrate: " + String(decoded.estimatedBitrate) + " bps");
            } else {
                showResult("Signal Decoder", "No captured signal");
            }
            break;
        }
        case 17: { // Advanced Signal Cloner
            AdvancedSignalCloner::CloneParams params;
            params.frequency = 433.0;
            params.repeatCount = 3;
            auto result = AdvancedSignalCloner::cloneSignal(params);
            if (result.success) {
                showResult("Advanced Signal Cloner",
                          "Bytes sent: " + String(result.transmittedBytes) + "\n" +
                          "Reps: " + String(result.repetitionsCompleted) + "\n" +
                          "Radio: " + result.radioUsed);
            } else {
                showResult("Advanced Signal Cloner", "Transmission failed");
            }
            break;
        }
        case 18: { // Mavic Jammer
            MavicJammer::JammerConfig config;
            config.durationMs = 10000;
            config.method = 0; // NOISE mode
            auto result = MavicJammer::jammMavicController(config);
            if (result.success) {
                showResult("Mavic Jammer",
                          "Duration: " + String(result.durationMs) + "ms\n" +
                          "Packets: " + String(result.packetsJammed) + "\n" +
                          "Hops: " + String(result.frequencyChanges));
            } else {
                showResult("Mavic Jammer", result.error);
            }
            break;
        }
        case 19: { // TPMS Spoofer
            TPMSSpoofer::TPMSConfig config;
            config.durationMs = 10000;
            config.frequency = 433000000;
            config.attackMode = 0; // Low pressure
            auto result = TPMSSpoofer::captureTPMSSensors(10000, 433000000);
            if (result.success) {
                showResult("TPMS Spoofer",
                          "Sensors found: " + String(result.spoofedSensorIDs.size()) + "\n" +
                          "Freq: 433 MHz\n" +
                          "Status: " + result.attackDescription);
            } else {
                showResult("TPMS Spoofer", result.error);
            }
            break;
        }
    }
}

void runIotAction(int idx) {
    switch (idx) {
        case 0: { // Zigbee Scanner
            auto result = ZigbeeScanner::scanZigbeeDevices(15000);
            if (result.deviceCount > 0) {
                // Show Zigbee network device visualization
                AdvancedScanning::NetworkDeviceData zigbeeData;
                zigbeeData.title = "Zigbee Network";
                zigbeeData.totalDevices = result.deviceCount;
                zigbeeData.strongestSignal = -65;  // Simulated
                zigbeeData.strongestDeviceName = "ZigbeeDev-00";

                // Device role distribution
                zigbeeData.devicesByType = {(uint16_t)(result.deviceCount * 0.2),  // Coordinator
                                           (uint16_t)(result.deviceCount * 0.3),  // Router
                                           (uint16_t)(result.deviceCount * 0.5)}; // End device
                zigbeeData.typeLabels = {"Coord", "Router", "EndDev"};

                AdvancedScanning::showNetworkDevices(zigbeeData);
            } else {
                showResult("Zigbee Scanner", "No devices found");
            }
            break;
        }
        case 1: { // MQTT Hijacker
            auto result = MqttHijacker::scanMqttBrokers(15000);
            showResult("MQTT Hijacker",
                      "Brokers found: " + String(result.brokerCount) + "\n" +
                      "Duration: " + String(result.durationMs) + "ms");
            break;
        }
        case 2: { // Z-Wave Scanner
            auto result = ZwaveScanner::scanZwaveNetwork(20000);
            if (result.nodeCount > 0) {
                // Show Z-Wave network device visualization
                AdvancedScanning::NetworkDeviceData zwaveData;
                zwaveData.title = "Z-Wave Network";
                zwaveData.totalDevices = result.nodeCount;
                zwaveData.strongestSignal = -60;  // Simulated
                zwaveData.strongestDeviceName = "ZWaveNode-1";

                // Device role distribution
                zwaveData.devicesByType = {(uint16_t)(result.nodeCount * 0.3),  // Controllers
                                          (uint16_t)(result.nodeCount * 0.4),  // Slaves
                                          (uint16_t)(result.nodeCount * 0.3)}; // Routing slaves
                zwaveData.typeLabels = {"Ctrl", "Slave", "Rtr"};

                AdvancedScanning::showNetworkDevices(zwaveData);
            } else {
                showResult("Z-Wave Scanner", "No nodes found");
            }
            break;
        }
        case 3: { // Bluetooth Classic
            auto result = BluetoothClassic::scanClassicDevices(10000);
            showResult("Bluetooth Classic",
                      "Devices found: " + String(result.deviceCount) + "\n" +
                      "Duration: " + String(result.durationMs) + "ms");
            break;
        }
        case 4: { // CoAP Scanner
            auto result = CoapScanner::scanCoapServers(15000);
            showResult("CoAP Scanner",
                      "Servers found: " + String(result.serverCount) + "\n" +
                      "Duration: " + String(result.durationMs) + "ms");
            break;
        }
        case 5: { // LoRaWAN Recon
            auto result = LoRawanRecon::scanLoRawanNetwork(20000);
            showResult("LoRaWAN Recon",
                      "Gateways found: " + String(result.gatewayCount) + "\n" +
                      "Duration: " + String(result.durationMs) + "ms");
            break;
        }
        case 6: { // RFID Emulator
            auto result = RfidEmulator::emulateRfidCard("HID", 10000);
            showResult("RFID Emulator",
                      "Emulating: " + result.cardType + "\n" +
                      "Duration: " + String(result.durationMs) + "ms");
            break;
        }
        case 7: { // Mifare Classic
            auto result = MifareClassic::readMifareCard();
            showResult("Mifare Classic",
                      String("Card read complete\n") +
                      "Data: " + result.sectorData.substring(0, 20));
            break;
        }
        case 8: { // NFC Cloner
            auto result = NfcCloner::readNfcTag();
            showResult("NFC Cloner",
                      "UID: " + result.tagUid + "\n" +
                      "Duration: " + String(result.durationMs) + "ms");
            break;
        }
        case 9: { // Smart Home Hijacker
            auto result = SmarthomeHijacker::hijackPhilipsHue("192.168.1.100", 15000);
            showResult("Smart Home Hijacker",
                      "Devices controlled: " + String(result.devicesControlled) + "\n" +
                      "Bridge: " + result.bridgeIp);
            break;
        }
        case 10: { // Spectrum Analyzer+
            auto result = SpectrumAnalyzerPlus::analyzeSpectrum(400.0, 5000.0, 20000);

