mathiscastel29560-arch/Esp32/src/menu.cpp
            // Build visualization data with simulated spectrum bins
            ScanVisualizations::SpectrumData specData;
            specData.peaksFound = result.peaksFound;
            specData.dominantFrequency = result.dominantFrequency;
            specData.dominantAmplitude = result.dominantAmplitude;

            // Create simulated frequency bins (32 bins with peaks at dominant frequency)
            specData.frequencyBins.resize(32);
            for (int i = 0; i < 32; i++) {
                uint8_t intensity = 50;  // Base noise floor

                // Add peak at dominant frequency (center)
                if (i >= 14 && i <= 18) {
                    intensity = 200 - (abs(i - 16) * 30);
                }
                // Add secondary peaks for variety
                if (i >= 4 && i <= 7) {
                    intensity = 120 - (abs(i - 5) * 20);
                }

                specData.frequencyBins[i] = (intensity < 255) ? intensity : 255;
            }

            // Show enhanced visualization
            ScanVisualizations::showSpectrumVisualization(specData);
            break;
        }
        case 11: { // Modulation Classifier
            auto result = ModulationClassifier::classifyModulation();
            showResult("Modulation Classifier",
                      "Type: " + result.modulationType + "\n" +
                      "Confidence: " + String((int)result.confidence) + "%");
            break;
        }
        case 12: { // Auto Handshake Capture
            auto result = AutoHandshakeCapture::autoCaptureHandshakes(30000);
            showResult("Auto Handshake Capture",
                      "Handshakes: " + String(result.handshakesRecovered) + "\n" +
                      "Targets: " + String(result.targetCount));
            break;
        }
        case 13: { // Generic Packet Tools
            auto result = GenericPacketTools::injectCustomPacket("ATTACK", "auto", 10000);
            showResult("Generic Packet Tools",
                      "Packets sent: " + String(result.packetsSent) + "\n" +
                      "Radio: " + result.radioType);
            break;
        }
        case 14: { // Advanced WiFi Attacks
            auto result = AdvancedWifiAttacks::executeKrackAttack(30000);
            showResult("Advanced WiFi Attacks",
                      "Success: " + String(result.success ? "Yes" : "No") + "\n" +
                      "Duration: " + String(result.durationMs) + "ms");
            break;
        }
    }
}

void runSystemAction(int idx) {
    switch (idx) {
        case 0: { // TX Arm
            showResult("TX Arm",
                      String(TxArm::isArmed() ? "ARMED" : "LOCKED") + "\n" +
                      "Hold BACK to arm");
            break;
        }
        case 1: { // Battery
            showResult("Battery",
                      String(Battery::percent()) + "%\n" +
                      String(Battery::voltage(), 2) + "V");
            break;
        }
        case 2: { // GPS
            showResult("GPS",
                      String(GpsModule::hasFix() ? "FIX OK" : "No fix") + "\n" +
                      String(GpsModule::latitude(), 4) + " " +
                      String(GpsModule::longitude(), 4));
            break;
        }
        case 3: { // Dualboot
            showResult("Dualboot",
                      "Switching to OTA1...\n(ESP32-DIV)");
            break;
        }
    }
}

void runSettingsAction(int idx) {
    switch (idx) {
        case 0: { // Set Date/Time
            DateTime current = Settings::getRTCTime();
            showResult("Set Date/Time",
                      "Current: " + Settings::formatRTCTime(current) + "\n" +
                      "Use web UI for now\n(http://esp32-audit.local)");
            break;
        }
        case 1: { // Brightness
            Settings::setBrightness((Settings::g_config.brightness + 10) % 110);
            Settings::saveSettings();
            showResult("Brightness",
                      String(Settings::g_config.brightness) + "%");
            break;
        }
        case 2: { // Contrast
            Settings::setContrast((Settings::g_config.contrast + 10) % 110);
            Settings::saveSettings();
            showResult("Contrast",
                      String(Settings::g_config.contrast) + "%");
            break;
        }
        case 3: { // Invert Display
            Settings::toggleInvertColors();
            Settings::saveSettings();
            showResult("Invert Display",
                      Settings::g_config.invertColors ? "ON" : "OFF");
            break;
        }
        case 4: { // Auto-Lock
            Settings::g_config.autoLock = !Settings::g_config.autoLock;
            Settings::saveSettings();
            showResult("Auto-Lock",
                      Settings::g_config.autoLock ? "ON" : "OFF");
            break;
        }
        case 5: { // Logging
            Settings::g_config.enableLogging = !Settings::g_config.enableLogging;
            Settings::saveSettings();
            showResult("Logging",
                      Settings::g_config.enableLogging ? "ON" : "OFF");
            break;
        }
    }
}

void runHardwareTestAction(int idx) {
    switch (idx) {
        case 0: { // GPIO Test
            showResult("GPIO Test", "Running...\nCheck serial output\n(5 seconds)");
            break;
        }
        case 1: { // RTC Test
            showResult("RTC Test", "Running...\nCheck serial output");
            break;
        }
        case 2: { // GPS Test
            showResult("GPS Test", "Running...\nWaiting for fix\n(up to 30 sec)");
            break;
        }
        case 3: { // PN532 Test
            showResult("PN532 Test", "Running...\nScanning cards\n(10 seconds)");
            break;
        }
        case 4: { // CC1101 Test
            showResult("CC1101 Test", "Running...\n433MHz listening\n(10 seconds)");
            break;
        }
        case 5: { // NRF24 Test
            showResult("NRF24 Test", "Running...\n2.4GHz sweep\n(20 seconds)");
            break;
        }
    }
}

void runDeviceInfoAction(int idx) {
    switch (idx) {
        case 0: { // Full Config
            showResult("Full Configuration",
                      "Pins configured OK\n" +
                      "SPI: CC1101+NRF24\n" +
                      "I2C: RTC+PN532\n" +
                      "UART1: GPS\n" +
                      "See HARDWARE.md for details");
            break;
        }
        case 1: { // Pin Assignments
            showResult("Pin Assignments",
                      "SPI: SCK=12 MOSI=11\n" +
                      "     MISO=13 CS(CC1101)=10\n" +
                      "     CS(NRF24)=14\n" +
                      "I2C: SDA=8 SCL=9\n" +
                      "GPS: RX=18 TX=17");
            break;
        }
        case 2: { // Hardware Guards
            showResult("Hardware Guards",
                      "✓ GPS/UART1 guard active\n" +
                      "✓ CC1101/SubGhz guard\n" +
                      "✓ SPI bus arbitration\n" +
                      "✓ I2C address isolation");
            break;
        }
        case 3: { // Initialized Modules
            showResult("Initialized Modules",
                      "✓ GPIO (buttons, buzzer)\n" +
                      "✓ RTC (DS3231)\n" +
                      "✓ GPS (if active)\n" +
                      "✓ PN532 (NFC)\n" +
                      "✓ CC1101 (433MHz)\n" +
                      "✓ NRF24 (2.4GHz)");
            break;
        }
    }
}

void runDebugInfoAction(int idx) {
    switch (idx) {
        case 0: { // Memory
            showResult("Memory Status",
                      "Free Heap: " + String(ESP.getFreeHeap() / 1024) + " KB\n" +
                      "Free PSRAM: " + String(ESP.getFreePsram() / 1024) + " KB\n" +
                      "Total Heap: " + String(ESP.getHeapSize() / 1024) + " KB");
            break;
        }
        case 1: { // Battery
            showResult("Battery Details",
                      "Voltage: " + String(Battery::voltage(), 2) + "V\n" +
                      "Percent: " + String(Battery::percent()) + "%\n" +
                      "Status: " + (Battery::percent() > 20 ? "OK" : "LOW"));
            break;
        }
        case 2: { // Active Modules
            showResult("Active Modules",
                      "WiFi: " + String(WiFi.isConnected() ? "Connected" : "Idle") + "\n" +
                      "Bluetooth: Idle\n" +
                      "GPS: " + String(GpsModule::hasFix() ? "FIX" : "Searching") + "\n" +
                      "RF: Ready");
            break;
        }
        case 3: { // Last Errors
            showResult("Recent Errors",
                      "No critical errors\n" +
                      "Check serial logs\n" +
                      "for warnings");
            break;
        }
    }
}

void runCalibrationAction(int idx) {
    switch (idx) {
        case 0: { // Battery ADC
            showResult("Battery Calibration",
                      "Current reading: " + String(analogRead(7)) + "\n" +
                      "Voltage: " + String(Battery::voltage(), 2) + "V\n" +
                      "Calibrate manually if needed");
            break;
        }
        case 1: { // RF Signal
            showResult("RF Signal Check",
                      "CC1101: Ready\n" +
                      "NRF24: Ready\n" +
                      "Run RF tests for details");
            break;
        }
        case 2: { // Display
            showResult("Display Calibration",
                      "Brightness: " + String(Settings::g_config.brightness) + "%\n" +
                      "Contrast: " + String(Settings::g_config.contrast) + "%\n" +
                      "Adjust in Settings menu");
            break;
        }
    }
}

void runAboutAction(int idx) {
    switch (idx) {
        case 0: { // Firmware Version
            showResult("Firmware Version",
                      "ESP32-S3 Offensive\n" +
                      "Security Platform\n" +
                      "Version: 2.0.0\n" +
                      "Build: 20250922");
            break;
        }
        case 1: { // Device Serial
            uint64_t chipid = ESP.getEfuseMac();
            showResult("Device Serial",
                      "Chip ID: " + String((uint32_t)(chipid >> 32), HEX) +
                      String((uint32_t)chipid, HEX));
            break;
        }
        case 2: { // MAC Address
            showResult("MAC Address",
                      "WiFi: " + WiFi.macAddress() + "\n" +
                      "BLE: (same as WiFi)");
            break;
        }
        case 3: { // Flash Size
            showResult("Flash Size",
                      "Total: " + String(ESP.getFlashChipSize() / (1024*1024)) + " MB\n" +
                      "Used: ~50% (estimated)\n" +
                      "Free: ~50% (estimated)");
            break;
        }
        case 4: { // Uptime
            uint32_t uptimeSeconds = millis() / 1000;
            uint32_t hours = uptimeSeconds / 3600;
            uint32_t minutes = (uptimeSeconds % 3600) / 60;
            showResult("Uptime",
                      String(hours) + "h " + String(minutes) + "m");
            break;
        }
    }
}

void runNetworkAction(int idx) {
    switch (idx) {
        case 0: { // WiFi Status
            showResult("WiFi Status",
                      "Status: " + String(WiFi.isConnected() ? "Connected" : "Disconnected") + "\n" +
                      "SSID: " + (WiFi.isConnected() ? WiFi.SSID() : "N/A") + "\n" +
                      "RSSI: " + (WiFi.isConnected() ? String(WiFi.RSSI()) + "dBm" : "N/A"));
            break;
        }
        case 1: { // IP Address
            showResult("IP Address",
                      "IP: " + (WiFi.isConnected() ? WiFi.localIP().toString() : "Not connected") + "\n" +
                      "Gateway: " + (WiFi.isConnected() ? WiFi.gatewayIP().toString() : "N/A"));
            break;
        }
        case 2: { // Hostname
            showResult("Hostname",
                      "esp32-audit.local\n" +
                      "or IP from WiFi section");
            break;
        }
        case 3: { // WiFi Settings
            showResult("WiFi Settings",
                      "Use web UI for\n" +
                      "WiFi configuration:\n" +
                      "http://esp32-audit.local");
            break;
        }
    }
}

