mathiscastel29560-arch/Esp32/src/menu.cpp
String drawBatteryBar(uint8_t percent) {
    String bar = "";
    uint8_t filled = percent / 10;
    for (uint8_t i = 0; i < 10; i++) {
        bar += (i < filled) ? "█" : "░";
    }
    return bar;
}

void drawStatusBar() {
    uint8_t batPercent = Battery::percent();
    String batBar = drawBatteryBar(batPercent);
    String wifiStatus = WiFi.isConnected() ? "✓ WiFi" : "✗ WiFi";
    String timeStatus = Settings::formatRTCTime(Settings::getRTCTime()).substring(11, 16);

    // Color based on battery level
    if (batPercent > 50) Serial.print(COLOR_GREEN);
    else if (batPercent > 20) Serial.print(COLOR_YELLOW);
    else Serial.print(COLOR_RED);

    Serial.println("┌─────────────────────────────────────────┐");
    Serial.print("│ ");
    Serial.print(COLOR_CYAN);
    Serial.print(wifiStatus);
    Serial.print(COLOR_RESET);
    if (batPercent > 50) Serial.print(COLOR_GREEN);
    else if (batPercent > 20) Serial.print(COLOR_YELLOW);
    else Serial.print(COLOR_RED);
    Serial.print(" │ 🔋" + batBar + " ");
    Serial.print(String(batPercent < 10 ? "  " : (batPercent < 100 ? " " : "")));
    Serial.print(String(batPercent) + "% │ 🕐 " + timeStatus + " │\n");
    Serial.print(COLOR_CYAN);
    Serial.println("└─────────────────────────────────────────┘");
    Serial.print(COLOR_RESET);
}

void drawSimpleMenu(const std::vector<String> &items, int selection, const String &title) {
    String icon = "";
    String bgColor = COLOR_RESET;

    if (title == "WIFI TOOLS") icon = "📡";
    else if (title == "BLE TOOLS") icon = "🔵";
    else if (title == "RF TOOLS") icon = "📶";
    else if (title == "IOT/ADVANCED") icon = "🌐";
    else if (title == "SYSTEM") icon = "⚙️ ";
    else if (title == "SETTINGS") icon = "⚙️ ";
    else if (title == "HARDWARE TEST") icon = "🧪";
    else if (title == "DEVICE INFO") icon = "ℹ️ ";
    else if (title == "DEBUG INFO") icon = "🐛";
    else if (title == "CALIBRATION") icon = "🔧";
    else if (title == "ABOUT") icon = "ℹ️ ";
    else if (title == "NETWORK") icon = "🌐";
    else if (title.indexOf("HELP") >= 0) icon = "❓";
    else if (title == "MAIN") icon = "⚡";

    Serial.println();
    drawStatusBar();
    Serial.println();

    Serial.print(COLOR_BLUE);
    Serial.println("╔═════════════════════════════════════════╗");
    Serial.print("║  " + icon + " ");
    Serial.print(COLOR_GREEN);
    Serial.print(title);
    Serial.print(COLOR_BLUE);
    Serial.println(String(32 - title.length(), ' ') + "║");
    Serial.println("╠═════════════════════════════════════════╣");
    Serial.print(COLOR_RESET);

    for (size_t i = 0; i < items.size(); i++) {
        String marker = (i == selection) ? "▶ " : "  ";
        String item = items[i];

        if (i == selection) {
            Serial.print(COLOR_GREEN);
            Serial.print("║ " + marker);
            Serial.print(COLOR_YELLOW);
            Serial.print(item);
            Serial.print(COLOR_GREEN);
            Serial.println(String(37 - marker.length() - item.length(), ' ') + "║");
            Serial.print(COLOR_RESET);
        } else {
            Serial.print(COLOR_CYAN);
            Serial.print("║ " + marker);
            Serial.print(COLOR_RESET);
            Serial.print(item);
            Serial.print(COLOR_CYAN);
            Serial.println(String(37 - marker.length() - item.length(), ' ') + "║");
            Serial.print(COLOR_RESET);
        }
    }

    Serial.print(COLOR_BLUE);
    Serial.println("╠═════════════════════════════════════════╣");
    Serial.print(COLOR_YELLOW);
    Serial.println("║  ▲/▼: navigate  ●: select  ◄: back    ║");
    Serial.print(COLOR_BLUE);
    Serial.println("╚═════════════════════════════════════════╝");
    Serial.print(COLOR_RESET);
}

} // namespace

namespace Menu {

void begin() {
    g_state = HOME;
    g_selection = 0;
}

void loop() {
    // Get button input
    Buttons::Button btn = Buttons::poll();
    bool upPress = (btn == Buttons::UP);
    bool dnPress = (btn == Buttons::DOWN);
    bool okPress = (btn == Buttons::SELECT);
    bool backTap = consumeBackTap();

    std::vector<String> items;

    switch (g_state) {
        case HOME:
            if (okPress) {
                g_state = MAIN_MENU;
                g_selection = 0;
            }
            Serial.println();
            drawStatusBar();
            Serial.println();

            Serial.print(COLOR_GREEN);
            Serial.println("╔═════════════════════════════════════════╗");
            Serial.println("║                                         ║");
            Serial.println("║      ⚡ ESP32-S3 SECURITY AUDIT ⚡     ║");
            Serial.println("║                                         ║");
            Serial.println("║         Offensive Security Tool         ║");
            Serial.println("║              Version 2.0.0              ║");
            Serial.println("║                                         ║");
            Serial.print(COLOR_CYAN);
            Serial.println("║  🔧 Real Hardware Drivers               ║");
            Serial.println("║  📡 WiFi • BLE • RF • IoT               ║");
            Serial.println("║  🧪 Isolated Hardware Tests             ║");
            Serial.println("║                                         ║");
            Serial.print(COLOR_GREEN);
            Serial.println("╠═════════════════════════════════════════╣");
            Serial.print(COLOR_YELLOW);
            Serial.println("║                                         ║");
            Serial.println("║       Press ● to begin                  ║");
            Serial.println("║                                         ║");
            Serial.print(COLOR_GREEN);
            Serial.println("╚═════════════════════════════════════════╝");
            Serial.print(COLOR_RESET);
            break;

        case MAIN_MENU:
            items = mainMenuItems();
            if (upPress) g_selection = (g_selection - 1 + items.size()) % items.size();
            if (dnPress) g_selection = (g_selection + 1) % items.size();
            if (okPress) {
                switch (g_selection) {
                    case 0: g_state = WIFI_SUBMENU; break;
                    case 1: g_state = BLE_SUBMENU; break;
                    case 2: g_state = RF_SUBMENU; break;
                    case 3: g_state = IOT_SUBMENU; break;
                    case 4: g_state = SYSTEM_SUBMENU; break;
                    case 5: g_state = SETTINGS_SUBMENU; break;
                    case 6: g_state = HARDWARE_TEST_SUBMENU; break;
                    case 7: g_state = DEVICE_INFO_SUBMENU; break;
                    case 8: g_state = DEBUG_INFO_SUBMENU; break;
                    case 9: g_state = CALIBRATION_SUBMENU; break;
                    case 10: g_state = ABOUT_SUBMENU; break;
                    case 11: g_state = NETWORK_SUBMENU; break;
                    case 12: g_state = HELP_SUBMENU; break;
                }
                g_selection = 0;
            }
            drawSimpleMenu(items, g_selection, "MAIN");
            break;

