mathiscastel29560-arch/Esp32/src/menu.cpp
        case WIFI_SUBMENU:
            items = wifiMenuItems();
            if (upPress) g_selection = (g_selection - 1 + items.size()) % items.size();
            if (dnPress) g_selection = (g_selection + 1) % items.size();
            if (okPress) {
                if (g_selection == items.size() - 1) {
                    g_state = MAIN_MENU;
                    g_selection = 0;
                } else {
                    runWifiAction(g_selection);
                }
            }
            drawSimpleMenu(items, g_selection, "WIFI TOOLS");
            break;

        case BLE_SUBMENU:
            items = bleMenuItems();
            if (upPress) g_selection = (g_selection - 1 + items.size()) % items.size();
            if (dnPress) g_selection = (g_selection + 1) % items.size();
            if (okPress) {
                if (g_selection == items.size() - 1) {
                    g_state = MAIN_MENU;
                    g_selection = 1;
                } else {
                    runBleAction(g_selection);
                }
            }
            drawSimpleMenu(items, g_selection, "BLE TOOLS");
            break;

        case RF_SUBMENU:
            items = rfMenuItems();
            if (upPress) g_selection = (g_selection - 1 + items.size()) % items.size();
            if (dnPress) g_selection = (g_selection + 1) % items.size();
            if (okPress) {
                if (g_selection == items.size() - 1) {
                    g_state = MAIN_MENU;
                    g_selection = 2;
                } else {
                    runRfAction(g_selection);
                }
            }
            drawSimpleMenu(items, g_selection, "RF TOOLS");
            break;

        case IOT_SUBMENU:
            items = iotMenuItems();
            if (upPress) g_selection = (g_selection - 1 + items.size()) % items.size();
            if (dnPress) g_selection = (g_selection + 1) % items.size();
            if (okPress) {
                if (g_selection == items.size() - 1) {
                    g_state = MAIN_MENU;
                    g_selection = 3;
                } else {
                    runIotAction(g_selection);
                }
            }
            drawSimpleMenu(items, g_selection, "IOT/ADVANCED");
            break;

        case SYSTEM_SUBMENU:
            items = systemMenuItems();
            if (upPress) g_selection = (g_selection - 1 + items.size()) % items.size();
            if (dnPress) g_selection = (g_selection + 1) % items.size();
            if (okPress) {
                if (g_selection == items.size() - 1) {
                    g_state = MAIN_MENU;
                    g_selection = 4;
                } else {
                    runSystemAction(g_selection);
                }
            }
            drawSimpleMenu(items, g_selection, "SYSTEM");
            break;

        case SETTINGS_SUBMENU:
            items = settingsMenuItems();
            if (upPress) g_selection = (g_selection - 1 + items.size()) % items.size();
            if (dnPress) g_selection = (g_selection + 1) % items.size();
            if (okPress) {
                if (g_selection == items.size() - 1) {
                    g_state = MAIN_MENU;
                    g_selection = 5;
                } else {
                    runSettingsAction(g_selection);
                }
            }
            drawSimpleMenu(items, g_selection, "SETTINGS");
            break;

        case HARDWARE_TEST_SUBMENU:
            items = hardwareTestMenuItems();
            if (upPress) g_selection = (g_selection - 1 + items.size()) % items.size();
            if (dnPress) g_selection = (g_selection + 1) % items.size();
            if (okPress) {
                if (g_selection == items.size() - 1) {
                    g_state = MAIN_MENU;
                    g_selection = 6;
                } else {
                    runHardwareTestAction(g_selection);
                }
            }
            drawSimpleMenu(items, g_selection, "HARDWARE TEST");
            break;

        case DEVICE_INFO_SUBMENU:
            items = deviceInfoMenuItems();
            if (upPress) g_selection = (g_selection - 1 + items.size()) % items.size();
            if (dnPress) g_selection = (g_selection + 1) % items.size();
            if (okPress) {
                if (g_selection == items.size() - 1) {
                    g_state = MAIN_MENU;
                    g_selection = 7;
                } else {
                    runDeviceInfoAction(g_selection);
                }
            }
            drawSimpleMenu(items, g_selection, "DEVICE INFO");
            break;

        case DEBUG_INFO_SUBMENU:
            items = debugInfoMenuItems();
            if (upPress) g_selection = (g_selection - 1 + items.size()) % items.size();
            if (dnPress) g_selection = (g_selection + 1) % items.size();
            if (okPress) {
                if (g_selection == items.size() - 1) {
                    g_state = MAIN_MENU;
                    g_selection = 8;
                } else {
                    runDebugInfoAction(g_selection);
                }
            }
            drawSimpleMenu(items, g_selection, "DEBUG INFO");
            break;

        case CALIBRATION_SUBMENU:
            items = calibrationMenuItems();
            if (upPress) g_selection = (g_selection - 1 + items.size()) % items.size();
            if (dnPress) g_selection = (g_selection + 1) % items.size();
            if (okPress) {
                if (g_selection == items.size() - 1) {
                    g_state = MAIN_MENU;
                    g_selection = 9;
                } else {
                    runCalibrationAction(g_selection);
                }
            }
            drawSimpleMenu(items, g_selection, "CALIBRATION");
            break;

        case ABOUT_SUBMENU:
            items = aboutMenuItems();
            if (upPress) g_selection = (g_selection - 1 + items.size()) % items.size();
            if (dnPress) g_selection = (g_selection + 1) % items.size();
            if (okPress) {
                if (g_selection == items.size() - 1) {
                    g_state = MAIN_MENU;
                    g_selection = 10;
                } else {
                    runAboutAction(g_selection);
                }
            }
            drawSimpleMenu(items, g_selection, "ABOUT");
            break;

